---
kind: enumMember
id: F:Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithDetailing
enum: Autodesk.Revit.DB.SheetDuplicateOption
source: html/0d924cfe-327d-d3ca-9576-9e3280a1b1a4.htm
---
# Autodesk.Revit.DB.SheetDuplicateOption.DuplicateSheetWithDetailing

Duplicate the sheet, copy the title block and details.